#寬度
print('%d'%(12345))#未設定寬度，輸出：12345
print('%8d'%(12345))#△△△12345
print('%-8d'%(-12345))#-12345△△
print('%08d'%(12345))#00012345
print('%3d'%(-12345))#寬度(3)不足時，輸出還是輸出全部-12345
print('%c'%('A'))#A
print('%4c'%('A'))#△△△A
print('%c'%(65))#65系統根據ASCII自動轉換成A
print('%s'%('ABCDE'))#ABCDE
print('%8s'%('ABCDE'))#△△△ABCDE
print('%3s'%('ABCDE'))#ABCDE
print('%6.2s'%('ABCDE'))#△△△△AB取2字


print('%f'%12345.67)#小數點後預設位數為6位數，不夠會自動補0
print('%f'%-12.345)
print('%.2f'%12.345)#小數點後兩位，第三位會四捨五入
print('%8.2f'%-12.345)#整數部分8-2=6-「點」=5位數，小數點後2位
print('%3.1f'%123.45)
print('%8.0f'%-1234.56)

#改用科學記號顯示，e指數位數佔2位(不含+-號)，小數部分佔6位
print('%E'%1234567.89)
print('%e'%123.4)
print('%10.2e'%12345.6)
print('%10.2E'%0.000123456)

print('%#x'%12345)#16進位
print('%08d'%12345)#空格補0，輸出：00012345
print('%-8d'%12345)#靠左對齊12345△△△
print('% d'%12345)#△12345


